{
  "asin": "B0CS9RQTFC",
  "title": "California Design Den King Sheet Set - Luxury 1000 Thread Count Sateen, Thick and Natural 100% Cotton Sheets, Deep Pockets, Soft, Breathable and Durable Bedding Set - Beige (Sand Tone)",
  "category": "Bed Sheets",
  "breadcrumbs": [
    "Home & Kitchen",
    "›",
    "Bedding",
    "›",
    "Sheets & Pillowcases",
    "›",
    "Sheet & Pillowcase Sets"
  ],
  "price": "89.",
  "rating": 4.4,
  "review_count": 3882,
  "description": "Architectural Digest Best Sheet Category Winner 2024: This luxuriously soft and substantially thick 100% cotton sateen king deep pocket sheets set, crafted from 1000 thread count, delivers a smooth feel and cool breathability of high-end hotel bedding. With a dense weave that softens beautifully after washes, they’re perfect for those who prefer a rich, heavier sheet rather than something lightweight. This king sheet set is perfect for uninterrupted sleep all year round.Important Note on this Color: This Beige (Sand Tone) shade is a warm, soft beige with subtle earthy-red undertones – it is not grey-taupe or cool beige.Sheet Set with a Great Fit: Our 4-piece beige sheets king set includes a top sheet (112\" W x 102\" L), a deep pocket bottom fitted sheet (78\" W x 80\" L) for mattresses 8 to 16 inches deep, and two king size pillowcases (21\" W x 41\" L). Fitted sheet features all-round elastic with deep pocket fit, ensuring it won't loosen or bunch up, with head/foot side indicators to make bed-making a breeze.Certified Safe, Durable & Easy Care: Our king bed sheet set is made from premium cotton grown in India—independently tested for quality, safety, and certified STANDARD 100 by OEKO-TEX. Machine-wash warm and tumble-dry low. For a smooth, wrinkle free finish, remove promptly from the dryer. Made from extra-long staple cotton, these king bed sheets withstand pilling, shrinking, and fading, getting softer with each wash and lasting for years.Our Commitment: We prioritize comfort, community, and sustainability. Since 2022, we've donated over 36,000 bedding items to US charities and removed plastic from our packaging. Sheets are crafted in our family‑owned factory in India with care and quality‑checked—thread count may vary by ±5% due to standard manufacturing limits. Enjoy affordable luxury and hassle‑free returns for a better night’s sleep.",
  "image_url": "https://m.media-amazon.com/images/I/71N6elHqwRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
  "url": "https://www.amazon.com/dp/B0CS9RQTFC?ref=t_ac_view_request_product_image&campaignId=amzn1.campaign.2D36SCEUF8IN1&linkCode=tr1&tag=homeprinciple-20&linkId=amzn1.campaign.2D36SCEUF8IN1_1757854568771"
}